Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/courts_system/circuit_court_civil_juris.html.txt.tmx
Source language: en
Languages: ga

source: The country is divided into eight circuits for the purposes of the Circuit Court
ga: Tá an tír roinnte ina hocht gcuaird ar mhaithe leis an gCúirt Chuarda

source: The Circuit Court consists of the President of the Court and 37 ordinary judges
ga: Is éard atá sa Chúirt Chuarda ná Uachtarán na Cúirte agus 37 gnáthbhreitheamh

source: One Circuit Judge is assigned to each circuit, except in the case of the Dublin and Cork Circuits
ga: Tá Breitheamh Cuarda ainmnithe le haghaidh gach cuaird, ach amháin le haghaidh Bhaile Átha Cliath agus Chorcaigh

source: Ten judges can be assigned to the Dublin Circuit and 3 to the Cork Circuit
ga: Is féidir le deichniúr breitheamh a bheith ainmnithe don chuaird i mBaile Átha Cliath agus triúr don chuaird i gCorcaigh

source: The President of the Circuit Court, who is also an additional Judge of the High Court, has the duty of ensuring an equitable distribution of the work of the Circuit Court amongst the several judges and the prompt despatch of business
ga: Tá dualgas ar Uachtarán na Cúirte Cuarda, atá ina b(h)reitheamh breise san Ard-Chúirt, a chinntiú go ndáiltear obair na Cúirte Cuarda go cothrom ar na breithimh chomh maith le cinntiú go bpléitear leis go pras

source: Under the Personal Insolvency Act 2012 provision was made for a maximum of 8 new specialist judges to facilitate the speedy consideration of insolvency applications
ga: Faoin Acht um Dócmhainneacht Phearsanta 2012, rinneadh soláthar ar feadh uasmhéid de 8 breithiúna speisialtóireachta nua chun breithniú tapa na n-iarratas dócmhainneachta

source: The Circuit Court is a court of local and limited jurisdiction
ga: Is cúirt áitiúil agus le húdarás srianta é an Chúirt Chuarda

source: It is restricted as to which cases it can decide in both civil and criminal matters
ga: Tá sí srianta ó thaobh na gcásanna ar féidir léi cinneadh a dhéanamh i gcúinsí sibhialta agus coiriúla

source: Under Part 3 of the Courts and Civil Law (Miscellaneous Provisions) Act 2013 the monetary jurisdiction of the Circuit Court increased to €75,000 (was €38,092.14) with effect from 3 February 2014
ga: Faoi Chuid 3 d'Acht na gCúirteanna agus an Dlí Sibhialta (Forálacha Ilghnéitheacha) 2013 an dlínse airgeadaíochta na Cúirte Cuarda méadaithe go dtí €75,000 (ba é €38,092.14) le héifeacht ón 3 Feabhra 2014

source: For personal injury actions the limit is €60,000
ga: I gcás caingne díobhálacha pearsanta é an teorainn €60,000

source: A Circuit Court cannot hear a case that has not been commenced in the correct County
ga: Ní féidir le Cúirt Chuarda éisteacht le cás nár thosaíodh sa Chontae ceart

source: The case must be brought, heard and decided in the County
ga: Ní mór an cás a thógáil, éisteacht leis agus cinneadh a dhéanamh air sa Chontae

source: • in proceedings based on tort (e.g., personal injuries actions), where the tort is alleged to have been committed or where the defendant or one of the defendants ordinarily resides or carries on any profession, business or occupation;
ga: • i ngnáthaimh bunaithe ar thort (m.sh., gnáthaimh i leith dochar pearsanta), ina n-éilítear gur tharla an tort nó san áit ina bhfuil cónaí ar an gcosantóir nó duine de na cosantóirí de ghnáth nó san áit ina bhfuil siad ag obair, ina bhfuil gnó nó fostaíocht acu;

source: • in proceedings based on contract, where the contract was made or where the defendant or one of the defendants ordinarily resides or carries on any profession, business or occupation;
ga: • i ngnáthaimh bunaithe ar chonradh, san áit inar rinneadh an conradh nó san áit ina bhfuil cónaí ar an gcosantóir nó duine de na cosantóirí de ghnáth nó san áit ina bhfuil siad ag obair, ina bhfuil gnó nó fostaíocht acu;

source: • in proceedings to eject a person from lands or property, where the lands or property in question are located;
ga: • i ngnáthaimh chun duine a íobairt ó thailte nó ó mhaoin, san áit ina bhfuil na tailte nó an mhaoin atá i gceist lonnaithe;

source: • in family proceedings, where the applicant resides;
ga: • i ngnáthaimh chlainne, san áit ina bhfuil cónaí ar an iarratasóir;

source: • under the probate jurisdiction and for administration of estates of deceased persons, where the testator or intestate at the time of his death had a fixed place of abode;
ga: • faoin údarás probháide agus chun seilbh daoine éagtha a riar, san áit ina raibh áit chónaithe bhuan ag an tiomnóir nó díthiomnach nuair a fuair sé/sí bás;

source: • under the lunacy jurisdiction, where the person of, or alleged to be of, unsound mind ordinarily resides
ga: • faoin údarás gealtachais, san áit ina bhfuil gnáthchónaí ar an duine nach bhfuil nó a líomhnaítear nach bhfuil ceart ó thaobh na hintinne de

source: Civil cases in the Circuit Court are tried by a judge sitting without a jury
ga: Éisteann breitheamh a shuíonn gan ghiúiré le cásanna sibhialta sa Chúirt Chuarda

source: The Circuit Court is restricted to hearing cases where the damages or compensation sought do not exceed a certain amount
ga: Tá srian ar an gCúirt Chuarda maidir le héisteacht le cásanna ina dtéann na damáistí nó an cúiteamh atá á n-éileamh thar méid áirithe

source: The Circuit Court has jurisdiction, i.e., it can hear and decide cases:
ga: Tá údarás ag an gCúirt Chuarda, m.sh. is féidir léi cinntí a dhéanamh:

source: • in actions in contract and tort where the claim does not exceed €75,000 (€60,000 for personal injury actions)
ga: • i gcásanna conartha agus torta nuair nach dtéann an t-éileamh thar €75,000 (€60,000 le haghaidh gníomhaíochtaí díobhála pearsanta)

source: • in actions for defamation where the claim does not exceed €75,000
ga: • i gcásanna clúmhillte nuair nach dtéann an t-éileamh thar €75,000

source: • in probate matters and suits for the administration of estates, where the market value of the real estate does not exceed €3,000,000
ga: • i gcásanna probháide agus agraí dlí maidir le riar eastát, nuair nach dtéann an luach margadh den fhíor-eastát thar €3,000,000

source: • in equity suits, where the market value of the land does not exceed €3,000,000
ga: • in eagraí dlí cothroime, nuair nach dtéann an luach margadh de thalamh thar €3,000,000

source: • in ejectment actions or applications for new tenancies (fixing of rent, etc.,) where the market value of the property does not exceed €3,000,000
ga: • i gcásanna eisiachtana nó iarratais ar thionóntachtaí nua (cíos a dhaingniú, srl.) nuair nach dtéann an luach margadh den mhaoin thar €3,000,000

source: • in actions founded on hire-purchase and credit-sale agreements, where the hire-purchase price of the goods or the amount of the claim does not exceed €75,000
ga: • i gcásanna bunaithe ar chomhaontuithe fruilcheannaigh agus díolacháin creidmheasa, nuair nach dtéann praghas ceannaigh na n-earraí nó méid an éilimh thar €75,000

source: • in family law proceedings, (including judicial separation, divorce, nullity and appeals from the District Court)
ga: • i gcásanna dlí teaghlaigh, (lena n-áirítear scaradh breithiúnach, colscaradh, neamhbhrí agus achomhairc ón gCúirt Dhúiche)

source: Where the market value of the property exceeds €3,000,000, the parties may opt to transfer the case to the High Court
ga: Nuair a théann an luach margadh den mhaoin thar €3,000,000, is féidir leis na páirtithe cinneadh a dhéanamh an cás a athrú chuig an Ard-Chúirt

source: • in all cases of application for new liquor on-licence (i.e., licences for sale of liquor for consumption on the premises) and has appellate jurisdiction from decisions of arbitrators in disputes in relation to Ground Rents under the Landlord and Tenant legislation
ga: • i ngach cás ina ndéantar iarratas ar cheadúnas liocáire nua (m.sh. ceadúnais do dhíol liocáire le hól ar an bhfód) agus tá údarás achomhairc aici ó chinntí eadránaithe i ndíospóidí maidir le Cíosanna Talún faoin reachtaíocht Thiarnaí Talún agus Tionóntaí

source: • in respect of applications under the former Workmen's Compensation Code, i.e., in cases where the right to compensation arose prior to 1st May 1967
ga: • maidir le hiarratais faoin Iarchód um Chúiteamh d’Oibrithe, m.sh. i gcásanna inar dtáinig teidlíocht ar chúiteamh chun cinn roimh an 1 Bealtaine 1967

source: • in appeals from the District Court in both civil and criminal matters
ga: • in achomhairc ón gCúirt Dhúiche i gcásanna sibhialta agus coiriúla

source: The appeal takes the form of a re-hearing and the decision of the Circuit Court is final and not appealable
ga: Is éard atá ann don achomhairc ná ath-éisteacht agus is é cinneadh na Cúirte Cuarda an cinneadh críochnúil agus ní féidir iarratas a dhéanamh ar achomharc

source: In criminal matters, the Circuit Court Judge sits with a jury of twelve
ga: I gcásanna coiriúla, suíonn Breitheamh na Cúirte Cuarda le giúiré de dháréag

source: A verdict need not be unanimous in a case where there are not fewer than eleven jurors if ten of them agree on a verdict after considering the case for a reasonable time (not less than two hours)
ga: Ní gá go mbeadh fíorasc comhaontach i gcás nach bhfuil níos lú ná aon ghiúróir déag má aontaíonn deichniúr acu ar fhíorasc tar éis dóibh machnamh a dhéanamh ar feadh tréimhse réasúnta (ní féidir leis an tréimhse a bheith níos lú ná dhá uair an chloig)

source: The criminal jurisdiction is exercised by the judge of the Circuit in which
ga: Tá an t-údarás coiriúil curtha i bhfeidhm ag breitheamh na Cuarda ina

source: • the offence was committed or
ga: • rinneadh an choir nó

source: • where the defendant resides or carries on business or
ga: • bhfuil cónaí ar an gcosantóir nó ina ndéanann sé/sí a g(h)nó nó

source: However, the Circuit Judge may transfer a criminal trial from one part of his/her Circuit to another
ga: Ach, is féidir le Breitheamh Cuarda triail choiriúil a aistriú ó chuid amháin dá C(h)uaird go ceann eile

source: On application by the Director of Public Prosecutions or the accused, the Circuit Judge may, if satisfied that it would be manifestly unjust not to do so, transfer the trial from the Circuit Court sitting outside of the Dublin Circuit to the Dublin Circuit Court
ga: Ar iarratas ón Stiúrthóir Ionchúiseamh Poiblí nó an cúisí, is féidir leis an mBreitheamh Cuarda, má tá sé sásta go mbeadh sé éagórach go follasach gan é a dhéanamh, an triail a aistriú ón gCúirt Chuarda atá ag suí taobh amuigh de Chuaird Bhaile Átha Cliath go dtí Cúirt Chuarda Bhaile Átha Cliath

source: The Constitution specifies that all non-minor offences must, in general, involve a trial with a jury
ga: Sainíonn an Bhunreacht gur cheart go mbeadh triail le giúiré i gceist le gach coir nach mionchoir é, go ginearálta

source: All minor criminal cases are heard in the District Court summarily (i.e., without a jury)
ga: Éistear le gach mionchoir choiriúil sa Chúirt Dhúiche go hachomair (m.sh. gan ghiúiré)

source: The Circuit Court has the jurisdiction to hear all non-minor offences, except murder, rape, aggravated sexual assault, treason, piracy and related offences
ga: Tá an t-údarás ag an gCúirt Chuarda éisteacht le gach coir nach mionchoir iad, ach amháin dúnmharú, éigniú, tromionsaí gnéasach, tréastúireacht, píoráideacht agus coireanna gaolmhara
